{
  "backend/main.mo": "Motoko backend defining surgery case types, user profiles, authorization checks, and CRUD functions for creating and retrieving cases.",
  "feature_evidence.json": "Metadata report linking a deployment-trigger feature to its associated file, components, and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of multiple frontend source files.",
  "frontend/index.css": "Global Tailwind CSS setup defining OKLCH-based color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point loading the root div and main TypeScript module.",
  "frontend/public/deploy-retry.txt": "Timestamp marker file used to trigger a redeploy or backend canister restart.",
  "frontend/scripts/generateProjectFilesManifest.mjs": "Node script that scans the project, filters files, and writes a manifest JSON listing all included file paths.",
  "frontend/src/App.tsx": "Main React app configuring router, auth initialization, role provisioning, and unauthenticated login screen.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling II authentication, logout cleanup, and React Query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Empty file placeholder for profile setup modal component.",
  "frontend/src/components/cases/CaseForm.tsx": "Form component for creating or editing surgery cases with validation, autofill, and MRN-based duplicate detection.",
  "frontend/src/components/cases/QuickAddDemographics.tsx": "UI for parsing and applying demographics from pasted text or OCR via camera, with editable parsed fields.",
  "frontend/src/components/cases/ToDoSection.tsx": "Manages a case-specific to‑do list with add, toggle, and delete operations using query hooks.",
  "frontend/src/components/debug/DebugPanel.tsx": "Debug interface showing identity, actor status, role info, case counts, and project files with refresh and copy actions.",
  "frontend/src/components/debug/ProjectFilesSection.tsx": "Displays and filters project file paths, supports copying filtered lists, and handles loading or error states.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with navigation, footer, offline sync listener, and toggleable debug panel.",
  "frontend/src/components/layout/TopNav.tsx": "Top navigation bar showing app title, login status, offline indicator, and optional debug button.",
  "frontend/src/components/offline/OfflineStatusIndicator.tsx": "UI component showing online/offline status, pending offline changes, and controls for syncing or viewing queued operations.",
  "frontend/src/components/offline/OfflineSyncListener.tsx": "Loads pending offline operations on mount to initialize offline sync state.",
  "frontend/src/components/offline/PendingChangesDialog.tsx": "Dialog listing queued offline operations with metadata and actions to retry, remove, or clear all.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCallerRoleDebug.ts": "Fetches and polls the caller's backend role for debugging when enabled.",
  "frontend/src/hooks/useEnsureUserRoleProvisioning.ts": "Automatically ensures logged-in users receive the user role, retrying with limits and showing errors if provisioning fails.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout, and identity loading via a React context.",
  "frontend/src/hooks/useOfflineStatus.ts": "Tracks browser online/offline status using window events.",
  "frontend/src/hooks/useOfflineSync.ts": "Manages syncing queued offline operations to the backend actor and updates operation statuses accordingly.",
  "frontend/src/hooks/useProjectFilesManifest.ts": "Loads and validates the build's project-files-manifest.json using React Query and returns its metadata.",
  "frontend/src/hooks/useProvisioningStatus.ts": "Tracks provisioning progress for the current identity, including retries, timing, and success or timeout state.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating case data with offline caching and queued operations.",
  "frontend/src/index.css": "Defines Tailwind base styles and light/dark theme CSS variables for the app's color system.",
  "frontend/src/main.tsx": "Initializes the React app root with React Query and Internet Identity providers.",
  "frontend/src/pages/CaseDetailPage.tsx": "Displays and edits a single case with offline fallback, update/delete actions, and form-driven UI.",
  "frontend/src/pages/CaseListPage.tsx": "Lists, filters, sorts, imports, and exports cases with offline-awareness and navigation to case details.",
  "frontend/src/pages/NewCasePage.tsx": "Renders the new case creation page, handling form submission, offline behavior, and navigation.",
  "frontend/src/types/offlineOps.ts": "Defines TypeScript types for queued offline operations such as creating, updating, and deleting cases and todos.",
  "frontend/src/utils/caseMatching.ts": "Provides a helper to find the most recent case by MRN using arrivalDate and id sorting.",
  "frontend/src/utils/dateTime.ts": "Utility functions for converting between backend bigint timestamps, Date objects, and YYYY-MM-DD strings.",
  "frontend/src/utils/demographicsParser.ts": "Parses free‑text demographics into structured fields like MRN, names, dates, species, and breed, returning found, missing, and uncertain data.",
  "frontend/src/utils/icStoppedCanisterError.ts": "Detects stopped‑canister errors, extracts canister IDs, and provides explanation and suggested actions.",
  "frontend/src/utils/logoutCleanup.ts": "Clears offline cache and queued operations during logout, returning success status and any errors.",
  "frontend/src/utils/ocrText.ts": "Performs client‑side OCR using the TextDetector API, returning extracted text or error details.",
  "frontend/src/utils/offlineDb.ts": "Manages IndexedDB storage for case lists, individual case data, and offline operation queues.",
  "frontend/src/utils/offlineQueue.ts": "Handles enqueueing, retrieving, updating, and clearing offline operations in IndexedDB.",
  "frontend/src/utils/safeErrorMessage.ts": "Converts unknown error values into safe displayable strings using several fallback strategies.",
  "frontend/src/utils/surgeryCaseCsvImport.ts": "Parses CSV rows for surgery cases, handling headers, booleans, species/sex enums, quoted fields, and to‑do parsing with error reporting.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins like typography and container queries.",
  "project_state.json": "JSON metadata describing project state, backend outage issues, and a feature to trigger redeployment by updating a retry marker file."
}