{
  "backend/main.mo": "Actor managing surgery cases with CRUD operations, todo generation, and authorization checks.",
  "backend/migration.mo": "Migration converting old surgery case records to new format by adding empty todos and initializing nextToDoId.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend source files for reference.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML shell mounting the React application root and loading main.tsx.",
  "frontend/src/App.tsx": "Main app with routing, authentication gating, theme provider, and inline login handling.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity and clearing query cache on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Empty or placeholder file with no content provided.",
  "frontend/src/components/cases/CaseForm.tsx": "Form component for creating or editing surgery cases using react-hook-form, including demographic fields and status checkboxes.",
  "frontend/src/components/cases/QuickAddDemographics.tsx": "Utility component that parses pasted or OCR-extracted text to auto-fill demographic fields, with camera support and manual editing.",
  "frontend/src/components/cases/ToDoSection.tsx": "Renders and manages a case’s to-do list, allowing adding, completing, and deleting items via query hooks.",
  "frontend/src/components/layout/AppLayout.tsx": "Page layout with top navigation, content container, and footer including a caffeine.ai credit link.",
  "frontend/src/components/layout/TopNav.tsx": "Navigation bar showing branding, user identity, and login button, with click-to-home behavior.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login, persisted identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for listing, fetching, creating, updating, and deleting surgery cases, including helper logic for mapping form data to todo items.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light and dark themes with a teal clinical color scheme.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/CaseDetailPage.tsx": "Displays detailed case info with editing and deletion capabilities, using react-query mutations and navigation.",
  "frontend/src/pages/CaseListPage.tsx": "Shows a searchable, sortable list of cases with import/export features and navigation to individual case pages.",
  "frontend/src/pages/NewCasePage.tsx": "Provides a form for creating a new case and handles submission with navigation and success/error toasts.",
  "frontend/src/utils/dateTime.ts": "Contains helpers for converting between bigint timestamps, Date objects, and YYYY-MM-DD formatted strings.",
  "frontend/src/utils/demographicsParser.ts": "Parses free‑text demographics into structured fields, extracting MRN, names, dates, species, breed, and sex with tracking for missing or uncertain data.",
  "frontend/src/utils/ocrText.ts": "Provides client-side OCR using the experimental TextDetector API, handling image loading, text extraction, and error cases.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL and hash parameters, persisting them in sessionStorage, and clearing stored or hash-based params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, and theme settings with additional plugins for typography, container queries, and animations.",
  "project_state.json": "Stores the project’s feature list, requirements, and metadata describing app goals like editable demographics, todos, import/export, and sorting."
}