{
  "backend/main.mo": "Motoko canister defining surgery case types and CRUD methods with access control and in‑memory storage.",
  "feature_evidence.json": "Lists features, related source files, components, and test IDs for offline caching and sync functionality.",
  "frontend-file-summaries.txt": "JSON-like document summarizing major frontend files and their roles in the app.",
  "frontend/index.css": "Tailwind CSS base theme defining OKLCH color tokens for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the root div and bootstrapping the frontend app.",
  "frontend/src/App.tsx": "Main React app configuring routes, authentication gating, layout, and theming.",
  "frontend/src/components/auth/LoginButton.tsx": "Auth button handling Internet Identity login/logout and clearing caches and queues.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Empty placeholder component for user profile setup modal.",
  "frontend/src/components/cases/CaseForm.tsx": "Form for creating and editing surgery cases with validation, demographics autofill, and checkbox fields.",
  "frontend/src/components/cases/QuickAddDemographics.tsx": "Component for parsing demographic text or OCR-scanned images into structured fields and applying them to a case.",
  "frontend/src/components/cases/ToDoSection.tsx": "Renders a case-specific to‑do list with add, toggle, and delete actions using query hooks.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with top navigation, footer, and an offline sync listener.",
  "frontend/src/components/layout/TopNav.tsx": "Top navigation bar showing app title, identity info, offline status, and login button.",
  "frontend/src/components/offline/OfflineStatusIndicator.tsx": "Displays online/offline status, pending sync count, and controls for syncing and viewing queued changes.",
  "frontend/src/components/offline/OfflineSyncListener.tsx": "Loads pending offline operations on mount to enable background sync.",
  "frontend/src/components/offline/PendingChangesDialog.tsx": "Dialog listing pending offline operations with retry and clear‑all controls.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hook for managing Internet Identity authentication, including loading, login, logout, and identity status tracking.",
  "frontend/src/hooks/useOfflineStatus.ts": "Tracks browser online/offline status and exposes isOnline and isOffline flags.",
  "frontend/src/hooks/useOfflineSync.ts": "Handles syncing queued offline operations to the backend when connectivity returns, updating operation status and clearing completed items.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating case data with offline caching and queued fallback operations for network failures.",
  "frontend/src/index.css": "Tailwind CSS setup with custom light/dark clinical-themed color variables and base styles.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider and renders the root component.",
  "frontend/src/pages/CaseDetailPage.tsx": "Displays a single case with edit and delete functionality, supporting offline fallback using cached case data.",
  "frontend/src/pages/CaseListPage.tsx": "Shows searchable and sortable case list with offline indicators and supports CSV import/export operations.",
  "frontend/src/pages/NewCasePage.tsx": "Page component that renders the new case form, handles create-case submission, and navigates back after success or error.",
  "frontend/src/types/offlineOps.ts": "Defines TypeScript types for all offline queue operations such as creating, updating, and deleting cases or todos.",
  "frontend/src/utils/caseMatching.ts": "Provides a utility to find the most recent case matching a given MRN by sorting by arrival date and ID.",
  "frontend/src/utils/dateTime.ts": "Contains helpers for converting between backend bigint timestamps and human-readable or HTML date strings.",
  "frontend/src/utils/demographicsParser.ts": "Parses free‑text demographics into structured fields like MRN, names, dates, species, and breed, returning found, missing, and uncertain fields.",
  "frontend/src/utils/ocrText.ts": "Wrapper for browser TextDetector API to extract text from images and return structured OCR results with error handling.",
  "frontend/src/utils/offlineDb.ts": "IndexedDB helper module for caching case lists, individual cases, and storing queued operations for offline use.",
  "frontend/src/utils/offlineQueue.ts": "Manages the offline operation queue with functions to enqueue, fetch, update, and remove queued operations in IndexedDB.",
  "frontend/src/utils/surgeryCaseCsvImport.ts": "Implements CSV parsing and validation for surgery cases, including field normalization, enum parsing, and boolean handling.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins such as typography, container queries, and animate.",
  "project_state.json": "Describes current project state, requirements, and features focused on adding offline caching and sync behavior for surgery case data."
}