{
  "backend/main.mo": "Motoko backend defining surgery case types, user profiles, access control, and CRUD methods including case creation with todo items.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-like mapping of frontend file paths to their high-level functional descriptions.",
  "frontend/index.css": "Tailwind-based global CSS defining OKLCH color tokens for light and dark modes and base element styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/scripts/generateProjectFilesManifest.mjs": "Node script that recursively scans the project, filters excluded patterns, and outputs a manifest JSON of all project files.",
  "frontend/src/App.tsx": "Main React app configuring router, authentication gating, auto-role provisioning, and layout rendering.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth with full React Query cache clearing and logout cleanup.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Placeholder component file with no implementation content.",
  "frontend/src/components/cases/CaseForm.tsx": "Renders a case creation/edit form with auto-fill, MRN duplicate detection, and numerous patient and status fields using react-hook-form.",
  "frontend/src/components/cases/QuickAddDemographics.tsx": "Provides a demographics quick‑add tool that parses pasted or OCR-extracted text and lets users edit and apply parsed values.",
  "frontend/src/components/cases/ToDoSection.tsx": "Displays and manages a case‑specific to‑do list with add, toggle, and delete actions linked to backend mutations.",
  "frontend/src/components/debug/DebugPanel.tsx": "Shows debugging info including identity, actor status, role, case stats, and stopped‑canister diagnostics with refresh and copy utilities.",
  "frontend/src/components/debug/ProjectFilesSection.tsx": "Loads and filters a project file manifest, showing results with copy-to-clipboard support and basic error/loading states.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with navigation, footer, offline sync, and an optional debug panel tied to user identity.",
  "frontend/src/components/layout/TopNav.tsx": "Renders the top navigation bar with branding, login controls, offline indicator, and optional debug toggle.",
  "frontend/src/components/offline/OfflineStatusIndicator.tsx": "UI popover button showing online/offline status, pending offline operations, and manual sync controls.",
  "frontend/src/components/offline/OfflineSyncListener.tsx": "Loads pending offline operations on mount using the offline sync hook.",
  "frontend/src/components/offline/PendingChangesDialog.tsx": "Dialog listing pending offline operations with labels, statuses, retry and clear options.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useCallerRoleDebug.ts": "Queries the backend for the caller's role for debugging, with optional polling.",
  "frontend/src/hooks/useEnsureUserRoleProvisioning.ts": "Automatically provisions the user role after login with retries and error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity state management using AuthClient.",
  "frontend/src/hooks/useOfflineStatus.ts": "Tracks browser online/offline status via navigator and window events.",
  "frontend/src/hooks/useOfflineSync.ts": "Handles loading and syncing queued offline operations with the backend actor once online, updating operation status and clearing successful entries.",
  "frontend/src/hooks/useProjectFilesManifest.ts": "Fetches and validates a static manifest listing project files for build inspection using React Query.",
  "frontend/src/hooks/useProvisioningStatus.ts": "Tracks provisioning progress of user role setup, exposing state, retries, errors, and timing for debugging.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for case CRUD operations with offline caching and offline-queue fallbacks.",
  "frontend/src/index.css": "Defines Tailwind base styles and a light/dark theme using custom CSS variables.",
  "frontend/src/main.tsx": "Bootstraps the React app with query and identity providers and loads global styles.",
  "frontend/src/pages/CaseDetailPage.tsx": "Displays and edits a single case with offline fallbacks, update/delete actions, and cached data support.",
  "frontend/src/pages/CaseListPage.tsx": "Shows searchable, sortable case lists with offline indicators and supports import/export operations.",
  "frontend/src/pages/NewCasePage.tsx": "Renders the new case creation page with a form and handles submitting a create-case mutation with offline support.",
  "frontend/src/types/offlineOps.ts": "Defines TypeScript types for queued offline operations related to surgery cases and todos.",
  "frontend/src/utils/caseMatching.ts": "Provides a function to find the most recent case for a given MRN by sorting matching cases.",
  "frontend/src/utils/dateTime.ts": "Utility functions for converting between Date objects, HTML date strings, and backend bigint timestamps.",
  "frontend/src/utils/demographicsParser.ts": "Parses free‑text demographics into structured fields, tracking missing and uncertain values.",
  "frontend/src/utils/icStoppedCanisterError.ts": "Detects stopped‑canister errors, extracts canister IDs, and generates related messages.",
  "frontend/src/utils/logoutCleanup.ts": "Performs best‑effort cleanup of offline cache and queued operations during logout.",
  "frontend/src/utils/ocrText.ts": "Implements client‑side OCR using the TextDetector API with fallbacks and error handling.",
  "frontend/src/utils/offlineDb.ts": "Manages IndexedDB storage for cached case lists, individual cases, and operation queue entries.",
  "frontend/src/utils/offlineQueue.ts": "Provides functions to enqueue, query, update, and clear offline queued operations in IndexedDB.",
  "frontend/src/utils/safeErrorMessage.ts": "Converts unknown error values into a safe, user‑displayable string.",
  "frontend/src/utils/surgeryCaseCsvImport.ts": "Parses CSV rows for surgery cases, including field normalization, enum parsing, boolean handling, and CSV line parsing with quotes.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, clear, and persist URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing schema versions, features, and configuration for DebugPanel improvements."
}