{
  "backend/main.mo": "Motoko canister defining SurgeryCase CRUD with access control, notes support, and sorted listing using an in‑memory Map.",
  "backend/migration.mo": "Migration module converting old case records to include a new notes field initialized to an empty string.",
  "feature_evidence.json": "Feature evidence report linking frontend files to features adding and propagating the notes field.",
  "frontend-file-summaries.txt": "Collected summaries of major frontend files describing case pages, forms, utilities, and notes-field additions.",
  "frontend/index.css": "Tailwind-based global styles defining theme variables for light and dark modes.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "App root configuring routing, authentication gating, theming, and login UI.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout and clearing React Query cache.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Empty placeholder file for a profile setup modal component.",
  "frontend/src/components/cases/CaseForm.tsx": "Reusable case form component including demographics, checklist fields, and a notes textarea with create/edit support.",
  "frontend/src/components/cases/QuickAddDemographics.tsx": "Component for parsing demographics from text or OCR, allowing edits and applying parsed values to a case.",
  "frontend/src/components/cases/ToDoSection.tsx": "Renders and manages case to-do items with add, toggle, and delete actions via React Query mutations.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main page layout with top navigation, content container, and footer.",
  "frontend/src/components/layout/TopNav.tsx": "Displays the top navigation bar with app branding, user identity, and login button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identities and handling login/logout states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for listing, retrieving, creating, updating, and deleting cases and to-do items.",
  "frontend/src/index.css": "Tailwind CSS setup with custom color variables and theming for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/CaseDetailPage.tsx": "Displays and edits a specific case, handling updates, deletion, and loading states.",
  "frontend/src/pages/CaseListPage.tsx": "Lists all cases with search, sorting, CSV/JSON import, and export features.",
  "frontend/src/pages/NewCasePage.tsx": "Provides a form to create a new surgery case and submit it to the backend.",
  "frontend/src/utils/caseMatching.ts": "Finds the most recent case matching an MRN by sorting on arrivalDate and id.",
  "frontend/src/utils/dateTime.ts": "Utility functions for converting between bigint timestamps, dates, and HTML date strings.",
  "frontend/src/utils/demographicsParser.ts": "Parses free‑text demographic info into structured fields, tracking missing and uncertain values.",
  "frontend/src/utils/ocrText.ts": "Extracts text from images using the browser TextDetector API with fallback error handling.",
  "frontend/src/utils/surgeryCaseCsvImport.ts": "Parses CSV rows into SurgeryCase objects with validation for enums, booleans, dates, and todos.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning hash params.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugins.",
  "project_state.json": "Stores project metadata, existing features, and pending requests related to adding a notes field to surgery cases."
}