{
  "backend/main.mo": "Motoko actor defining surgery case types, storage, and CRUD methods with authorization checks using AccessControl.",
  "feature_evidence.json": "Feature evidence metadata linking MRN auto-fill functionality to specific frontend files and components.",
  "frontend-file-summaries.txt": "Collection of short summaries for all major frontend source files, focusing on pages, components, and utilities.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app with TanStack Router, authentication gating, layout, and theme/toast providers.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Empty placeholder component file for user profile setup modal.",
  "frontend/src/components/cases/CaseForm.tsx": "Form for creating and editing cases with duplicate MRN detection, auto-fill, and full case field inputs.",
  "frontend/src/components/cases/QuickAddDemographics.tsx": "UI component that parses pasted or OCR-extracted demographic text and lets users edit and apply parsed fields.",
  "frontend/src/components/cases/ToDoSection.tsx": "Manages case to‑do items including creation, toggling completion, and deletion using backend mutations.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with top navigation, content container, and footer.",
  "frontend/src/components/layout/TopNav.tsx": "Renders the sticky top navigation bar with app branding and login/identity info.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated backend actor, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and state tracking.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend case and to‑do operations with React Query for listing, creating, updating, and deleting data.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining the app’s light and dark themes.",
  "frontend/src/main.tsx": "App entry point initializing React, Internet Identity provider, React Query client, and global styles.",
  "frontend/src/pages/CaseDetailPage.tsx": "Displays a detailed case view with loading/error states and supports updating or deleting a case.",
  "frontend/src/pages/CaseListPage.tsx": "Shows a searchable, sortable case list with CSV/JSON import and export features.",
  "frontend/src/pages/NewCasePage.tsx": "Provides a form to create a new surgery case and navigates back after submission.",
  "frontend/src/utils/caseMatching.ts": "Finds the most recent case for an MRN by comparing arrival dates and IDs.",
  "frontend/src/utils/dateTime.ts": "Utility functions for converting between bigint timestamps, Date objects, and YYYY-MM-DD strings.",
  "frontend/src/utils/demographicsParser.ts": "Parses free‑text demographics into structured fields with tracking for missing or uncertain values.",
  "frontend/src/utils/ocrText.ts": "Extracts text from images using the experimental TextDetector API and returns success or error info.",
  "frontend/src/utils/surgeryCaseCsvImport.ts": "Parses CSV rows into SurgeryCase objects with validation for fields, enums, dates, booleans, and todos.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params, persist them in sessionStorage, and clear them from hash-based routes.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, animations, and plugins like typography and container queries.",
  "project_state.json": "Defines project metadata and requirements for MRN-based case lookup and auto-filled patient demographics."
}