{
  "kind": "build_request",
  "title": "Add offline mode with local case cache and deferred sync",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement an offline-aware local cache of surgery cases in the browser so previously loaded case data remains available when the network or IC canister is unreachable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add offline mode"
        ]
      },
      "acceptanceCriteria": [
        "If the user has previously loaded the case list while online, then turning on browser offline mode (or losing connectivity) still allows viewing the case list from a locally stored cache.",
        "If the user has previously opened a case detail page while online, then turning offline still allows viewing that case’s details and to-do list from the local cache.",
        "If no local cache exists yet (fresh install), offline mode shows an empty-state message indicating that data must be loaded at least once while online."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a clear UI indicator for connectivity/offline state and cache/sync status in the main app navigation/layout (e.g., in TopNav), using English user-facing text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add offline mode"
        ]
      },
      "acceptanceCriteria": [
        "When the browser is offline, a visible indicator shows the app is in Offline Mode.",
        "When the browser returns online, the indicator updates automatically without a page refresh.",
        "The indicator messaging is concise and does not block normal navigation."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Persist the case list and individual case query results to durable browser storage (IndexedDB preferred; localStorage acceptable if size constraints are handled) and restore them on app start so offline mode works after a reload.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add offline mode"
        ]
      },
      "acceptanceCriteria": [
        "Reloading the app while offline still displays the most recently cached case list and any cached case details.",
        "Cached data is stored per authenticated Internet Identity principal (do not mix cached cases between different logged-in users on the same browser).",
        "The cache layer does not require modifications to immutable frontend paths (e.g., do not edit frontend/src/main.tsx)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add offline-safe behavior for write actions (create/update/delete cases and to-do mutations): when offline or when the canister call fails due to network, queue the operation locally and apply an optimistic UI update; when connectivity returns, automatically replay the queued operations to the canister and reconcile the UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add offline mode"
        ]
      },
      "acceptanceCriteria": [
        "While offline, the user can create/update/delete a case or change to-dos and see the UI reflect the change immediately (optimistic update).",
        "Queued operations persist across reloads and are replayed once the app is back online and the actor is available.",
        "If a queued operation fails during replay, the user is notified with an English error message and the operation remains pending until the user retries or removes it.",
        "After successful replay, pending status is cleared and the React Query cache is refreshed from the canister."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Provide basic controls for offline data management: a manual “Sync now” action and a way to view/clear pending offline changes, with safeguards to prevent accidental data loss.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add offline mode"
        ]
      },
      "acceptanceCriteria": [
        "A user can trigger a manual sync attempt when online.",
        "A user can view how many pending offline changes exist.",
        "A user can clear pending offline changes only after confirming (confirmation UI required) and is warned that clearing will discard unsynced changes."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only UI component sources).",
    "Do not edit immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep the backend as a single Motoko actor (no new backend services, no external databases)."
  ],
  "nonGoals": [
    "Implementing multi-device conflict resolution beyond a simple last-write-wins approach during sync reconciliation.",
    "Adding real-time collaboration or live updates between multiple users/devices.",
    "Changing the backend data model/schema unless it becomes strictly necessary for offline sync (prefer frontend-only changes)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}