{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Duplicate MRN alert and demographics auto-fill on New Case",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "On New Case creation, detect duplicate MRN from the fetched cases list, toast an alert once per MRN change, and auto-fill demographics from the most recent matching prior case.",
      "acceptanceCriteria": [
        "On the New Case page, entering an MRN that already exists in the fetched cases list triggers a user-visible alert in English (e.g., a toast).",
        "After the duplicate MRN is detected, the CaseForm fields are auto-set to the matched case’s values for: MRN, date of birth, patient first name, patient last name, species, breed, and sex.",
        "When multiple cases share the same MRN, the form uses the most recent prior entry (define and implement as the case with the greatest arrivalDate; if tied/unavailable, fall back to the greatest id).",
        "The auto-fill/alert behavior only runs for new-case creation (i.e., when CaseForm has no initialData) and does not interfere with editing an existing case.",
        "The alert does not repeatedly fire on every render for the same MRN value (e.g., it should fire once per MRN entry/change)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/NewCasePage.tsx",
          "operation": "modify",
          "description": "Fetch the existing cases list (via the existing query hook) and pass it into CaseForm as an optional prop used only during new-case creation; keep user-facing text in English. Use the existing shadcn-ui toast/sonner setup already present in the app for any page-level messaging if needed. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/cases/CaseForm.tsx",
          "operation": "modify",
          "description": "Add optional input for the fetched cases list and implement duplicate-MRN detection for new-case mode only (when initialData is absent). On MRN change, find the most recent matching case (greatest arrivalDate, then greatest id), show a one-time-per-MRN toast alert in English using the existing toast/sonner integration, and auto-set fields (mrn, dateOfBirth, patientFirstName, patientLastName, species, breed, sex) via react-hook-form setValue without affecting edit flows. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/caseMatching.ts",
          "operation": "create",
          "description": "Introduce a small utility to select the most recent case for a given MRN (compare by arrivalDate desc, then id desc; handle empty/whitespace MRNs safely) to keep CaseForm logic clear and consistent with the acceptance criteria."
        }
      ]
    }
  ]
}